Revit 2027 API
ParameterTypeId.StructuralAttachmentBaseDistance Property
 "Base Attachment Distance"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId StructuralAttachmentBaseDistance { get; }
Public Shared ReadOnly Property StructuralAttachmentBaseDistance As ForgeTypeId
	Get
public:
static property ForgeTypeId^ StructuralAttachmentBaseDistance {
	ForgeTypeId^ get ();
}
static member StructuralAttachmentBaseDistance : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace